## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/10841896860)



<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * google_artifact_registry_repository.dockerhub_mirror
  * google_artifact_registry_repository_iam_member.dockerhub_mirror_access
* Update
  * google_service_account.sa_gke_kyma_integration
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.dockerhub_mirror will be created
  + resource "google_artifact_registry_repository" "dockerhub_mirror" {
      + create_time      = (known after apply)
      + description      = "Remote repository mirroring Docker Hub"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe-west4"
      + mode             = "REMOTE_REPOSITORY"
      + name             = (known after apply)
      + project          = "sap-kyma-prow"
      + repository_id    = "dockerhub-mirror"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + remote_repository_config {
          + description = "Mirror of Docker Hub"

          + docker_repository {
              + public_repository = "DOCKER_HUB"
            }
        }
    }

  # google_artifact_registry_repository_iam_member.dockerhub_mirror_access will be created
  + resource "google_artifact_registry_repository_iam_member" "dockerhub_mirror_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = (known after apply)
      + member     = "serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com"
      + project    = (known after apply)
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # google_service_account.sa_gke_kyma_integration will be updated in-place
  ~ resource "google_service_account" "sa_gke_kyma_integration" {
      ~ description  = "Service account is used by Prow to integrate with GKE. Will be removed with Prow" -> "Service account is used by Prow to integrate with GKE."
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11898,"Program":"tfcmt","SHA1":"05a5db2ba643f813309972f1790a7ace2e7a8776","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->